ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32F4/i2c_api.c
    int timeout;
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_HandleTypeDef *handle = &(obj_s->handle);

    MBED_ASSERT((hz > 0) && (hz <= 400000));

    // wait before init
    timeout = BYTE_TIMEOUT;
    while ((__HAL_I2C_GET_FLAG(handle, I2C_FLAG_BUSY)) && (--timeout != 0));

    // I2C configuration
    handle->Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    handle->Init.ClockSpeed      = hz;
    handle->Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
    handle->Init.DutyCycle       = I2C_DUTYCYCLE_2;
    handle->Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    handle->Init.NoStretchMode   = I2C_NOSTRETCH_DISABLED;
    handle->Init.OwnAddress1     = 0;
    handle->Init.OwnAddress2     = 0;
    HAL_I2C_Init(handle);

}

i2c_t *get_i2c_obj(I2C_HandleTypeDef *hi2c){

    /* Aim of the function is to get i2c_s pointer using hi2c pointer */
    /* Highly inspired from magical linux kernel's "container_of" */
    /* (which was not directly used since not compatible with IAR toolchain) */
    struct i2c_s *obj_s;
    i2c_t *obj;

    obj_s = (struct i2c_s *)( (char *)hi2c - offsetof(struct i2c_s,handle));
    obj = (i2c_t *)( (char *)obj_s - offsetof(i2c_t,i2c));

    return (obj);
}

inline int i2c_start(i2c_t *obj) {

    int timeout;
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_HandleTypeDef *handle = &(obj_s->handle);

    // Clear Acknowledge failure flag
    __HAL_I2C_CLEAR_FLAG(handle, I2C_FLAG_AF);

    // Wait the STOP condition has been previously correctly sent
    // This timeout can be avoid in some specific cases by simply clearing the STOP bit
    timeout = BYTE_TIMEOUT;
    while ((handle->Instance->CR1 & I2C_CR1_STOP) == I2C_CR1_STOP) {
        if ((timeout--) == 0) {
            return 1;
        }
    }

    // Generate the START condition
    handle->Instance->CR1 |= I2C_CR1_START;

    // Wait the START condition has been correctly sent
    timeout = BYTE_TIMEOUT;
    while (__HAL_I2C_GET_FLAG(handle, I2C_FLAG_SB) == RESET) {
        if ((timeout--) == 0) {
            return 1;
        }
    }

    return 0;
}

inline int i2c_stop(i2c_t *obj) {
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_TypeDef *i2c = (I2C_TypeDef *)obj_s->i2c;

    // Generate the STOP condition
    i2c->CR1 |= I2C_CR1_STOP;

    return 0;
}

int i2c_read(i2c_t *obj, int address, char *data, int length, int stop) {
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_HandleTypeDef *handle = &(obj_s->handle);
    int count = 0, ret = 0;
    uint32_t timeout = 0;

    if ((obj_s->XferOperation == I2C_FIRST_AND_LAST_FRAME) ||
        (obj_s->XferOperation == I2C_LAST_FRAME)) {
        if (stop)
            obj_s->XferOperation = I2C_FIRST_AND_LAST_FRAME;
        else
            obj_s->XferOperation = I2C_FIRST_FRAME;
    } else if ((obj_s->XferOperation == I2C_FIRST_FRAME) ||
        (obj_s->XferOperation == I2C_NEXT_FRAME)) {
        if (stop)
            obj_s->XferOperation = I2C_LAST_FRAME;
        else
            obj_s->XferOperation = I2C_NEXT_FRAME;
    }

    obj_s->event = 0;
    ret = HAL_I2C_Master_Sequential_Receive_IT(handle, address, (uint8_t *) data, length, obj_s->XferOperation);

    if(ret == HAL_OK) {
        timeout = BYTE_TIMEOUT_US * length;
        /*  transfer started : wait completion or timeout */
        while(!(obj_s->event & I2C_EVENT_ALL) && (--timeout != 0)) {
            wait_us(1);
        }

        if((timeout == 0) || (obj_s->event != I2C_EVENT_TRANSFER_COMPLETE)) {
            DEBUG_PRINTF(" TIMEOUT or error in i2c_read\r\n");
            /* re-init IP to try and get back in a working state */
            i2c_init(obj, obj_s->sda, obj_s->scl);
        } else {
            count = length;
        }
    } else {
        DEBUG_PRINTF("ERROR in i2c_read\r\n");
    }

    return count;
}

int i2c_write(i2c_t *obj, int address, const char *data, int length, int stop) {
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_HandleTypeDef *handle = &(obj_s->handle);
    int count = 0, ret = 0;
    uint32_t timeout = 0;

    if ((obj_s->XferOperation == I2C_FIRST_AND_LAST_FRAME) ||
        (obj_s->XferOperation == I2C_LAST_FRAME)) {
        if (stop)
            obj_s->XferOperation = I2C_FIRST_AND_LAST_FRAME;
        else
            obj_s->XferOperation = I2C_FIRST_FRAME;
    } else if ((obj_s->XferOperation == I2C_FIRST_FRAME) ||
        (obj_s->XferOperation == I2C_NEXT_FRAME)) {
        if (stop)
            obj_s->XferOperation = I2C_LAST_FRAME;
        else
            obj_s->XferOperation = I2C_NEXT_FRAME;
    }

    obj_s->event = 0;

    ret = HAL_I2C_Master_Sequential_Transmit_IT(handle, address, (uint8_t *) data, length, obj_s->XferOperation); 

    if(ret == HAL_OK) {
        timeout = BYTE_TIMEOUT_US * length;
        /*  transfer started : wait completion or timeout */
        while(!(obj_s->event & I2C_EVENT_ALL) && (--timeout != 0)) {
            wait_us(1);
        }

        if((timeout == 0) || (obj_s->event != I2C_EVENT_TRANSFER_COMPLETE)) {
            DEBUG_PRINTF(" TIMEOUT or error in i2c_write\r\n");
            /* re-init IP to try and get back in a working state */
            i2c_init(obj, obj_s->sda, obj_s->scl);
         } else {
            count = length;
       }
    } else {
        DEBUG_PRINTF("ERROR in i2c_read\r\n");
    }

    return count;
}

int i2c_byte_read(i2c_t *obj, int last) {

    int timeout;
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_HandleTypeDef *handle = &(obj_s->handle);

    if (last) {
        // Don't acknowledge the last byte
        handle->Instance->CR1 &= ~I2C_CR1_ACK;
    } else {
        // Acknowledge the byte
        handle->Instance->CR1 |= I2C_CR1_ACK;
    }

    // Wait until the byte is received
    timeout = BYTE_TIMEOUT;
    while (__HAL_I2C_GET_FLAG(handle, I2C_FLAG_RXNE) == RESET) {
        if ((timeout--) == 0) {
            return -1;
        }
    }

    return (int)handle->Instance->DR;
}

int i2c_byte_write(i2c_t *obj, int data) {

    int timeout;
    struct i2c_s *obj_s = I2C_S(obj);
    I2C_HandleTypeDef *handle = &(obj_s->handle);

